app/controllers/omniauth_callbacks_controller.rb

INSERT INTO "twitter_accounts" ("user_id", "name", "username", "image", "token", "secret", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def twitter
        Rails.logger.info auth

       Current.user.twitter_accounts.create(
        name: auth.info.name,
        username: auth.info.username ,
        image: auth.info.image,
        token: auth.info.token,
        secret: auth.info.secret,
       )