app/controllers/passwords_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2022-12-28 02:27:13.932672"], ["id", 9]]
---
    def update
        if Current.user.update(password_params)