app/controllers/password_resets_controller.rb

    def update
        @user = User.find_signed!(params[:token], purpose: "password_reset")
        if @user.update(password_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2022-12-28 23:54:44.735483"], ["id", 9]]