app/controllers/concerns/registrations_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "hey@mail.bg"], ["password_digest", "[FILTERED]"], ["created_at", "2022-12-26 00:59:43.645751"], ["updated_at", "2022-12-26 00:59:43.645751"]]
---
    def create
        @user = User.new(user_params)
        if @user.save